![example](images/director_shot.jpeg)

# Project Title

**Authors:** Student 1, Student 2, Student 3
***

## Overview

A one-paragraph overview of the project, including the business problem, data, methods, results and recommendations.

## Business Problem

Summary of the business problem you are trying to solve, and the data questions that you plan to answer to solve them.

***
Questions to consider:
* What are the business's pain points related to this project?
* How did you pick the data analysis question(s) that you did?
* Why are these questions important from a business perspective?
***

## Data Understanding

Describe the data being used for this project.
***
Questions to consider:
* Where did the data come from, and how do they relate to the data analysis questions?
* What do the data represent? Who is in the sample and what variables are included?
* What is the target variable?
* What are the properties of the variables you intend to use?
***

In [48]:
# Import standard packages
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

# Rotten Tomato Movie Info

In [49]:
rtmovie = pd.read_csv('./zippedData/rt.movie_info.tsv.gz', sep='\t')
rtmovie

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
0,1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN
1,3,"New York City, not-too-distant-future: Eric Pa...",R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013",$,"600,000",108 minutes,Entertainment One
2,5,Illeana Douglas delivers a superb performance ...,R,Drama|Musical and Performing Arts,Allison Anders,Allison Anders,"Sep 13, 1996","Apr 18, 2000",NaN,NaN,116 minutes,NaN
3,6,Michael Douglas runs afoul of a treacherous su...,R,Drama|Mystery and Suspense,Barry Levinson,Paul Attanasio|Michael Crichton,"Dec 9, 1994","Aug 27, 1997",NaN,NaN,128 minutes,NaN
4,7,NaN,NR,Drama|Romance,Rodney Bennett,Giles Cooper,NaN,NaN,NaN,NaN,200 minutes,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
1555,1996,Forget terrorists or hijackers -- there's a ha...,R,Action and Adventure|Horror|Mystery and Suspense,NaN,NaN,"Aug 18, 2006","Jan 2, 2007",$,"33,886,034",106 minutes,New Line Cinema
1556,1997,The popular Saturday Night Live sketch was exp...,PG,Comedy|Science Fiction and Fantasy,Steve Barron,Terry Turner|Tom Davis|Dan Aykroyd|Bonnie Turner,"Jul 23, 1993","Apr 17, 2001",NaN,NaN,88 minutes,Paramount Vantage
1557,1998,"Based on a novel by Richard Powell, when the l...",G,Classics|Comedy|Drama|Musical and Performing Arts,Gordon Douglas,NaN,"Jan 1, 1962","May 11, 2004",NaN,NaN,111 minutes,NaN
1558,1999,The Sandlot is a coming-of-age story about a g...,PG,Comedy|Drama|Kids and Family|Sports and Fitness,David Mickey Evans,David Mickey Evans|Robert Gunter,"Apr 1, 1993","Jan 29, 2002",NaN,NaN,101 minutes,NaN
1559,2000,"Suspended from the force, Paris cop Hubert is ...",R,Action and Adventure|Art House and Internation...,NaN,Luc Besson,"Sep 27, 2001","Feb 11, 2003",NaN,NaN,94 minutes,Columbia Pictures

# Rotten Tomato Reviews

In [50]:
rtreviews = pd.read_csv('./zippedData/rt.reviews.tsv.gz', delimiter='\t', encoding=('unicode_escape'))
rtreviews

,id,review,rating,fresh,critic,top_critic,publisher,date
0,3,A distinctly gallows take on contemporary fina...,3/5,fresh,PJ Nabarro,0,Patrick Nabarro,"November 10, 2018"
1,3,It's an allegory in search of a meaning that n...,NaN,rotten,Annalee Newitz,0,io9.com,"May 23, 2018"
2,3,... life lived in a bubble in financial dealin...,NaN,fresh,Sean Axmaker,0,Stream on Demand,"January 4, 2018"
3,3,Continuing along a line introduced in last yea...,NaN,fresh,Daniel Kasman,0,MUBI,"November 16, 2017"
4,3,... a perverse twist on neorealism...,NaN,fresh,NaN,0,Cinema Scope,"October 12, 2017"
...,...,...,...,...,...,...,...,...
54427,2000,The real charm of this trifle is the deadpan c...,NaN,fresh,Laura Sinagra,1,Village Voice,"September 24, 2002"
54428,2000,NaN,1/5,rotten,Michael Szymanski,0,Zap2it.com,"September 21, 2005"
54429,2000,NaN,2/5,rotten,Emanuel Levy,0,EmanuelLevy.Com,"July 17, 2005"
54430,2000,NaN,2.5/5,rotten,Christopher Null,0,Filmcritic.com,"September 7, 2003"
54431,2000,NaN,3/5,fresh,Nicolas Lacroix,0,Showbizz.net,"November 12, 2002"

# The Numbers

In [51]:
tnmovie = pd.read_csv('./zippedData/tn.movie_budgets.csv.gz')
tnmovie.head(10)

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"
5,6,"Dec 18, 2015",Star Wars Ep. VII: The Force Awakens,"$306,000,000","$936,662,225","$2,053,311,220"
6,7,"Apr 27, 2018",Avengers: Infinity War,"$300,000,000","$678,815,482","$2,048,134,200"
7,8,"May 24, 2007",Pirates of the Caribbean: At WorldÃ¢Â€Â™s End,"$300,000,000","$309,420,425","$963,420,425"
8,9,"Nov 17, 2017",Justice League,"$300,000,000","$229,024,295","$655,945,209"
9,10,"Nov 6, 2015",Spectre,"$300,000,000","$200,074,175","$879,620,923"

In [52]:
tnmovie.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

In [53]:
# the values we want to use (production_budget, domestic_gross, and worldwide_gross) are strings
# strip commas and $ to then convert to integers

In [54]:
punct = '$,'

In [55]:
mon_to_int = str.maketrans(dict.fromkeys(punct, ''))

In [56]:
tnmovie['worldwide_gross'] = '|'.join(tnmovie['worldwide_gross'].tolist()).translate(mon_to_int).split('|')
tnmovie['domestic_gross'] = '|'.join(tnmovie['domestic_gross'].tolist()).translate(mon_to_int).split('|')
tnmovie['production_budget'] = '|'.join(tnmovie['production_budget'].tolist()).translate(mon_to_int).split('|')

In [57]:
tnmovie['worldwide_gross'] = tnmovie['worldwide_gross'].astype(np.int64)
tnmovie['domestic_gross'] = tnmovie['domestic_gross'].astype(np.int64)
tnmovie['production_budget'] = tnmovie['production_budget'].astype(np.int64)

In [58]:
# release date to datetime
tnmovie['release_date'] = pd.to_datetime(tnmovie['release_date'])

In [59]:
# new column for domestic profit
tnmovie['domestic_profit'] = tnmovie['domestic_gross'] - tnmovie['production_budget']

In [60]:
# new column for worldwide profit
tnmovie['worldwide_profit'] = tnmovie['worldwide_gross'] - tnmovie['production_budget']

In [61]:
# new columns for domestic and worldwide profit margins represented by: profit/gross

In [62]:
tnmovie['domestic_margin'] = tnmovie['domestic_profit'] / tnmovie['domestic_gross']

In [63]:
tnmovie['worldwide_margin'] = tnmovie['worldwide_profit'] / tnmovie['worldwide_gross']

In [64]:
# new columns for domestic and worldwide ROI represented by: profit/budget

In [65]:
tnmovie['domestic_roi'] = tnmovie['domestic_profit'] / tnmovie['production_budget']

In [66]:
#makes sense to use value below as ROI
tnmovie['worldwide_roi'] = tnmovie['worldwide_profit'] / tnmovie['production_budget']

In [67]:
tnmovie2 = tnmovie.copy()

In [18]:
tnmovie2.head(20)

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,domestic_profit,worldwide_profit,domestic_margin,worldwide_margin
0,1,2009-12-18,Avatar,425000000,760507625,2776345279,335507625,2351345279,0.441163,0.846921
1,2,2011-05-20,Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,-169536125,635063875,-0.703283,0.607331
2,3,2019-06-07,Dark Phoenix,350000000,42762350,149762350,-307237650,-200237650,-7.184770,-1.337036
3,4,2015-05-01,Avengers: Age of Ultron,330600000,459005868,1403013963,128405868,1072413963,0.279748,0.764364
4,5,2017-12-15,Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747,303181382,999721747,0.488859,0.759251
5,6,2015-12-18,Star Wars Ep. VII: The Force Awakens,306000000,936662225,2053311220,630662225,1747311220,0.673308,0.850972
6,7,2018-04-27,Avengers: Infinity War,300000000,678815482,2048134200,378815482,1748134200,0.558054,0.853525
7,8,2007-05-24,Pirates of the Caribbean: At WorldÃ¢Â€Â™s End,300000000,309420425,963420425,9420425,663420425,0.030445,0.688609
8,9,2017-11-17,Justice League,300000000,229024295,655945209,-70975705,355945209,-0.309905,0.542645
9,10,2015-11-06,Spectre,300000000,200074175,879620923,-99925825,579620923,-0.499444,0.658944
10,11,2012-07-20,The Dark Knight Rises,275000000,448139099,1084439099,173139099,809439099,0.386351,0.746413
11,12,2018-05-25,Solo: A Star Wars Story,275000000,213767512,393151347,-61232488,118151347,-0.286444,0.300524
12,13,2013-07-02,The Lone Ranger,275000000,89302115,260002115,-185697885,-14997885,-2.079434,-0.057684
13,14,2012-03-09,John Carter,275000000,73058679,282778100,-201941321,7778100,-2.764098,0.027506
14,15,2010-11-24,Tangled,260000000,200821936,586477240,-59178064,326477240,-0.294679,0.556675
15,16,2007-05-04,Spider-Man 3,258000000,336530303,894860230,78530303,636860230,0.233353,0.711687
16,17,2016-05-06,Captain America: Civil War,250000000,408084349,1140069413,158084349,890069413,0.387382,0.780715
17,18,2016-03-25,Batman v Superman: Dawn of Justice,250000000,330360194,867500281,80360194,617500281,0.243250,0.711816
18,19,2012-12-14,The Hobbit: An Unexpected Journey,250000000,303003568,1017003568,53003568,767003568,0.174927,0.754180
19,20,2009-07-15,Harry Potter and the Half-Blood Prince,250000000,302089278,935213767,52089278,685213767,0.172430,0.732681

In [19]:
tnmovie.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   datetime64[ns]
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   int64
 4   domestic_gross     5782 non-null   int64
 5   worldwide_gross    5782 non-null   int64
 6   domestic_profit    5782 non-null   int64
 7   worldwide_profit   5782 non-null   int64
 8   domestic_margin    5782 non-null   float64
 9   worldwide_margin   5782 non-null   float64
dtypes: datetime64[ns](1), float64(2), int64(6), object(1)
memory usage: 451.8+ KB

In [20]:
tnmovie['movie']

0                                            Avatar
1       Pirates of the Caribbean: On Stranger Tides
2                                      Dark Phoenix
3                           Avengers: Age of Ultron
4                 Star Wars Ep. VIII: The Last Jedi
                           ...
5777                                         Red 11
5778                                      Following
5779                  Return to the Land of Wonders
5780                           A Plague So Pleasant
5781                              My Date With Drew
Name: movie, Length: 5782, dtype: object

In [21]:
tnmovie['movie'].value_counts()

Halloween                                  3
King Kong                                  3
Home                                       3
Pinocchio                                  2
Snitch                                     2
                                          ..
Living Dark: The Story of Ted the Caver    1
Chasing Liberty                            1
Les Triplettes de Belleville               1
Talk Radio                                 1
Noah                                       1
Name: movie, Length: 5698, dtype: int64

In [22]:
len(tnmovie['movie'].unique())

5698

In [23]:
tnmovie['domestic_gross'].max()

936662225

In [24]:
tnmovie['worldwide_margin'].max()

0.9994444444444445

In [25]:
tnmovie2 = tnmovie2.sort_values(by='worldwide_margin', ascending=True)
tnmovie.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,domestic_profit,worldwide_profit,domestic_margin,worldwide_margin
0,1,2009-12-18,Avatar,425000000,760507625,2776345279,335507625,2351345279,0.441163,0.846921
1,2,2011-05-20,Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,-169536125,635063875,-0.703283,0.607331
2,3,2019-06-07,Dark Phoenix,350000000,42762350,149762350,-307237650,-200237650,-7.184770,-1.337036
3,4,2015-05-01,Avengers: Age of Ultron,330600000,459005868,1403013963,128405868,1072413963,0.279748,0.764364
4,5,2017-12-15,Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747,303181382,999721747,0.488859,0.759251

# IMDB

In [26]:
import pandas as pd
import sqlite3

In [27]:
conn = sqlite3.connect('./zippedData/im.db')

In [28]:
pd.read_sql('''
SELECT *
FROM sqlite_master
;''', conn)

,type,name,tbl_name,rootpage,sql
0,table,movie_basics,movie_basics,2,"CREATE TABLE ""movie_basics"" (\n""movie_id"" TEXT..."
1,table,directors,directors,3,"CREATE TABLE ""directors"" (\n""movie_id"" TEXT,\n..."
2,table,known_for,known_for,4,"CREATE TABLE ""known_for"" (\n""person_id"" TEXT,\..."
3,table,movie_akas,movie_akas,5,"CREATE TABLE ""movie_akas"" (\n""movie_id"" TEXT,\..."
4,table,movie_ratings,movie_ratings,6,"CREATE TABLE ""movie_ratings"" (\n""movie_id"" TEX..."
5,table,persons,persons,7,"CREATE TABLE ""persons"" (\n""person_id"" TEXT,\n ..."
6,table,principals,principals,8,"CREATE TABLE ""principals"" (\n""movie_id"" TEXT,\..."
7,table,writers,writers,9,"CREATE TABLE ""writers"" (\n""movie_id"" TEXT,\n ..."

In [29]:
qq ="""
SELECT name 
AS 'Table Names' 
FROM sqlite_master 
WHERE type='table';"""
pd.read_sql(qq, conn)

     Table Names
0   movie_basics
1      directors
2      known_for
3     movie_akas
4  movie_ratings
5        persons
6     principals
7        writers

In [30]:
q1 = """
SELECT * 
 
FROM movie_basics;"""
pd.read_sql(q1, conn).head()

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [31]:
movie_basics = pd.read_sql(q1, conn)
movie_basics

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"
...,...,...,...,...,...,...
146139,tt9916538,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,2019,123.0,Drama
146140,tt9916622,Rodolpho TeÃ³philo - O Legado de um Pioneiro,Rodolpho TeÃ³philo - O Legado de um Pioneiro,2015,NaN,Documentary
146141,tt9916706,Dankyavar Danka,Dankyavar Danka,2013,NaN,Comedy
146142,tt9916730,6 Gunn,6 Gunn,2017,116.0,None
146143,tt9916754,Chico Albuquerque - RevelaÃ§Ãµes,Chico Albuquerque - RevelaÃ§Ãµes,2013,NaN,Documentary

In [32]:
movie_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   movie_id         146144 non-null  object
 1   primary_title    146144 non-null  object
 2   original_title   146123 non-null  object
 3   start_year       146144 non-null  int64
 4   runtime_minutes  114405 non-null  float64
 5   genres           140736 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

In [33]:
movie_basics.isna().sum()

movie_id               0
primary_title          0
original_title        21
start_year             0
runtime_minutes    31739
genres              5408
dtype: int64

In [34]:
q2 = """
SELECT * 
 
FROM known_for;"""
pd.read_sql(q2, conn)

         person_id   movie_id
0        nm0061671  tt0837562
1        nm0061671  tt2398241
2        nm0061671  tt0844471
3        nm0061671  tt0118553
4        nm0061865  tt0896534
...            ...        ...
1638255  nm9990690  tt9090932
1638256  nm9990690  tt8737130
1638257  nm9991320  tt8734436
1638258  nm9991320  tt9615610
1638259  nm9993380  tt8743182

[1638260 rows x 2 columns]

In [35]:
known_for = pd.read_sql(q2, conn)
known_for

         person_id   movie_id
0        nm0061671  tt0837562
1        nm0061671  tt2398241
2        nm0061671  tt0844471
3        nm0061671  tt0118553
4        nm0061865  tt0896534
...            ...        ...
1638255  nm9990690  tt9090932
1638256  nm9990690  tt8737130
1638257  nm9991320  tt8734436
1638258  nm9991320  tt9615610
1638259  nm9993380  tt8743182

[1638260 rows x 2 columns]

In [36]:
known_for.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1638260 entries, 0 to 1638259
Data columns (total 2 columns):
 #   Column     Non-Null Count    Dtype
---  ------     --------------    -----
 0   person_id  1638260 non-null  object
 1   movie_id   1638260 non-null  object
dtypes: object(2)
memory usage: 25.0+ MB

In [37]:
known_for.isna().sum()

person_id    0
movie_id     0
dtype: int64

In [38]:
known_for.person_id.unique()

array(['nm0061671', 'nm0061865', 'nm0062070', ..., 'nm9990690',
       'nm9991320', 'nm9993380'], dtype=object)

In [39]:
len(known_for.person_id.unique())

576444

In [40]:
len(known_for.movie_id.unique())

514781

In [41]:
q3 = """
SELECT * 
 
FROM principals;"""
pd.read_sql(q3, conn)

,movie_id,ordering,person_id,category,job,characters
0,tt0111414,1,nm0246005,actor,None,"[""The Man""]"
1,tt0111414,2,nm0398271,director,None,None
2,tt0111414,3,nm3739909,producer,producer,None
3,tt0323808,10,nm0059247,editor,None,None
4,tt0323808,1,nm3579312,actress,None,"[""Beth Boothby""]"
...,...,...,...,...,...,...
1028181,tt9692684,1,nm0186469,actor,None,"[""Ebenezer Scrooge""]"
1028182,tt9692684,2,nm4929530,self,None,"[""Herself"",""Regan""]"
1028183,tt9692684,3,nm10441594,director,None,None
1028184,tt9692684,4,nm6009913,writer,writer,None
1028185,tt9692684,5,nm10441595,producer,producer,None

In [42]:
principals = pd.read_sql(q3, conn)
principals

,movie_id,ordering,person_id,category,job,characters
0,tt0111414,1,nm0246005,actor,None,"[""The Man""]"
1,tt0111414,2,nm0398271,director,None,None
2,tt0111414,3,nm3739909,producer,producer,None
3,tt0323808,10,nm0059247,editor,None,None
4,tt0323808,1,nm3579312,actress,None,"[""Beth Boothby""]"
...,...,...,...,...,...,...
1028181,tt9692684,1,nm0186469,actor,None,"[""Ebenezer Scrooge""]"
1028182,tt9692684,2,nm4929530,self,None,"[""Herself"",""Regan""]"
1028183,tt9692684,3,nm10441594,director,None,None
1028184,tt9692684,4,nm6009913,writer,writer,None
1028185,tt9692684,5,nm10441595,producer,producer,None

In [43]:
principals.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1028186 entries, 0 to 1028185
Data columns (total 6 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   movie_id    1028186 non-null  object
 1   ordering    1028186 non-null  int64
 2   person_id   1028186 non-null  object
 3   category    1028186 non-null  object
 4   job         177684 non-null   object
 5   characters  393360 non-null   object
dtypes: int64(1), object(5)
memory usage: 47.1+ MB

In [44]:
principals.isna().sum()

movie_id           0
ordering           0
person_id          0
category           0
job           850502
characters    634826
dtype: int64

In [45]:
principals['category'].unique()

array(['actor', 'director', 'producer', 'editor', 'actress', 'composer',
       'cinematographer', 'writer', 'self', 'production_designer',
       'archive_footage', 'archive_sound'], dtype=object)

In [46]:
actors = pd.read_sql(
"""
SELECT
    category,
    pr.movie_id,
    pr.person_id,
    primary_name,
    primary_title 
FROM 
    principals AS pr
JOIN
    movie_basics AS mb using(movie_id)
JOIN
    persons AS pe using(person_id)
WHERE
    category = 'actor'
    or
    category = 'actress'
    or
    category = 'self'
""",conn)

In [47]:
actors

,category,movie_id,person_id,primary_name,primary_title
0,actor,tt0111414,nm0246005,Tommy Dysart,A Thin Life
1,actress,tt0323808,nm3579312,Brittania Nicol,The Wicker Tree
2,actor,tt0323808,nm2694680,Henry Garrett,The Wicker Tree
3,actor,tt0323808,nm0574615,Graham McTavish,The Wicker Tree
4,actress,tt0323808,nm0502652,Jacqueline Leonard,The Wicker Tree
...,...,...,...,...,...
468072,actor,tt9689618,nm10439726,Christian Lacroix,Moonface. A woman in the war.
468073,actor,tt9689618,nm10439727,Christine Spengler,Moonface. A woman in the war.
468074,actor,tt9689618,nm10439724,Phillippe Warner,Moonface. A woman in the war.
468075,actor,tt9692684,nm0186469,Kenneth Cranham,Disnatured
468076,self,tt9692684,nm4929530,Pearl Mackie,Disnatured

In [ ]:
# actor_filter = principals['category'] == 'actor'


actors1 = principals.loc[actor_filter]
actors1.head()

In [ ]:
actors2 = actors.copy()

In [ ]:
actors2 = actors2.drop('ordering', axis=1)

In [ ]:
actors2 = actors2.drop('job', axis=1)

In [ ]:
actors2

In [ ]:
len(actors2['movie_id'].unique())

In [ ]:
len(actors2['person_id'].unique())

In [ ]:
actors2['characters'].unique()

In [ ]:
len(actors2['characters'].unique())

In [ ]:
q4 = """
SELECT * 
 
FROM persons;"""
pd.read_sql(q4, conn)

In [ ]:
persons = pd.read_sql(q4, conn)
persons

In [ ]:
persons.info()

In [ ]:
persons.isna().sum()

In [ ]:
# Box Office Mojo
bom = pd.read_csv('./zippedData/bom.movie_gross.csv.gz')
bom

In [ ]:
bom.info()

In [ ]:
bom.describe()

In [ ]:
bom.value_counts()

In [ ]:
top_domestic_gross = bom['domestic_gross']

In [ ]:
top_domestic_gross.sort_values(by='domestic_gross', ascending=False).head(5)

In [ ]:
bom.keys()

In [ ]:
bom['year'].unique()

In [ ]:
bom.isna().sum()
# lots of missing data under "foreign_gross"

In [ ]:
len(bom['year'].unique())

# This data frame is not missing data under "years"
# Only has movie data for movies between years 2010 - 2018
# If other dataframes overlap with titles from this frame we can narrow analysis to movies from these years

In [ ]:
# The Movie DB
tmdb = pd.read_csv('./zippedData/tmdb.movies.csv.gz')
tmdb

In [ ]:
tmdb.head()

In [ ]:
tmdb.tail()

In [ ]:
tmdb.info()

In [ ]:
tmdb.value_counts()

In [ ]:
tmdb.describe()

In [ ]:
tmdb.keys()

In [ ]:
years = tmdb['release_date']

In [ ]:
tmdb.isna().sum()

## Data Preparation

Describe and justify the process for preparing the data for analysis.

***
Questions to consider:
* Were there variables you dropped or created?
* How did you address missing values or outliers?
* Why are these choices appropriate given the data and the business problem?
***

In [ ]:
# Here you run your code to clean the data

## Data Modeling
Describe and justify the process for analyzing or modeling the data.

***
Questions to consider:
* How did you analyze or model the data?
* How did you iterate on your initial approach to make it better?
* Why are these choices appropriate given the data and the business problem?
***

In [ ]:
# Here you run your code to model the data

## Evaluation
Evaluate how well your work solves the stated business problem.

***
Questions to consider:
* How do you interpret the results?
* How well does your model fit your data? How much better is this than your baseline model?
* How confident are you that your results would generalize beyond the data you have?
* How confident are you that this model would benefit the business if put into use?
***

## Conclusions
Provide your conclusions about the work you've done, including any limitations or next steps.

***
Questions to consider:
* What would you recommend the business do as a result of this work?
* What are some reasons why your analysis might not fully solve the business problem?
* What else could you do in the future to improve this project?
***